In [36]:
import numpy as np
import pandas as pd

from pandas import Series,DataFrame

In [21]:
ser1 = Series(np.arange(3),
             index=['B','E','R'])
ser1

B    0
E    1
R    2
dtype: int32

In [22]:
ser2 = Series(np.arange(11,13),
             index=['T','Z'])
ser2

T    11
Z    12
dtype: int32

In [23]:
pd.concat([ser1,ser2])

B     0
E     1
R     2
T    11
Z    12
dtype: int32

In [24]:
pd.concat([ser1,ser2],axis=1,sort=False)

     0     1
B  0.0   NaN
E  1.0   NaN
R  2.0   NaN
T  NaN  11.0
Z  NaN  12.0

In [25]:
pd.concat([ser1,ser2],keys=['ser1','ser2'])#satır ve sutun isimleri atadık

ser1  B     0
      E     1
      R     2
ser2  T    11
      Z    12
dtype: int32

In [26]:
pd.concat([ser1,ser2],ignore_index=True)#birleştirme yaparken index degerlerini yoksaydı.

0     0
1     1
2     2
3    11
4    12
dtype: int32

In [37]:
df1 = DataFrame(np.random.randn(4,3),
               columns=['X','Y','Z'])
df1

          X         Y         Z
0  2.186311  0.631701 -0.105044
1 -0.270116 -0.346043 -0.429873
2  0.021581 -1.634345 -0.325026
3 -1.119957 -0.369429  1.463321

In [39]:
df2  =DataFrame(np.random.rand(3,3),
                columns=['A','B','C'])
df2

          A         B         C
0  0.153887  0.107903  0.729577
1  0.062510  0.794275  0.867213
2  0.322729  0.528106  0.948443

In [43]:
pd.concat([df1,df2],sort=False)

          X         Y         Z         A         B         C
0  2.186311  0.631701 -0.105044       NaN       NaN       NaN
1 -0.270116 -0.346043 -0.429873       NaN       NaN       NaN
2  0.021581 -1.634345 -0.325026       NaN       NaN       NaN
3 -1.119957 -0.369429  1.463321       NaN       NaN       NaN
0       NaN       NaN       NaN  0.153887  0.107903  0.729577
1       NaN       NaN       NaN  0.062510  0.794275  0.867213
2       NaN       NaN       NaN  0.322729  0.528106  0.948443

In [44]:
pd.concat([df1,df2],sort=True)

          A         B         C         X         Y         Z
0       NaN       NaN       NaN  2.186311  0.631701 -0.105044
1       NaN       NaN       NaN -0.270116 -0.346043 -0.429873
2       NaN       NaN       NaN  0.021581 -1.634345 -0.325026
3       NaN       NaN       NaN -1.119957 -0.369429  1.463321
0  0.153887  0.107903  0.729577       NaN       NaN       NaN
1  0.062510  0.794275  0.867213       NaN       NaN       NaN
2  0.322729  0.528106  0.948443       NaN       NaN       NaN

In [45]:
pd.concat([df1,df2],keys=['df1','df2'])

              X         Y         Z         A         B         C
df1 0  2.186311  0.631701 -0.105044       NaN       NaN       NaN
    1 -0.270116 -0.346043 -0.429873       NaN       NaN       NaN
    2  0.021581 -1.634345 -0.325026       NaN       NaN       NaN
    3 -1.119957 -0.369429  1.463321       NaN       NaN       NaN
df2 0       NaN       NaN       NaN  0.153887  0.107903  0.729577
    1       NaN       NaN       NaN  0.062510  0.794275  0.867213
    2       NaN       NaN       NaN  0.322729  0.528106  0.948443

In [47]:
pd.concat([df1,df2],ignore_index=True,sort=False)#default outer

          X         Y         Z         A         B         C
0  2.186311  0.631701 -0.105044       NaN       NaN       NaN
1 -0.270116 -0.346043 -0.429873       NaN       NaN       NaN
2  0.021581 -1.634345 -0.325026       NaN       NaN       NaN
3 -1.119957 -0.369429  1.463321       NaN       NaN       NaN
4       NaN       NaN       NaN  0.153887  0.107903  0.729577
5       NaN       NaN       NaN  0.062510  0.794275  0.867213
6       NaN       NaN       NaN  0.322729  0.528106  0.948443

In [52]:
pd.concat([df1,df2],sort=False,join='inner')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 0, 1, 2]

In [53]:
df3 = pd.DataFrame({'W': ['W0', 'W1', 'W2'],
                     'X': ['X0', 'X1', 'X2']},
                      index=['I0', 'I1', 'I2']) 

df4 = pd.DataFrame({'Q': ['Q0', 'Q2', 'Q3'],
                    'Y': ['Y0', 'Y2', 'Y3']},
                      index=['I0', 'I2', 'I3'])

In [54]:
df3

     W   X
I0  W0  X0
I1  W1  X1
I2  W2  X2

In [55]:
df4

     Q   Y
I0  Q0  Y0
I2  Q2  Y2
I3  Q3  Y3

In [57]:
df3.join(df4,how='inner')

     W   X   Q   Y
I0  W0  X0  Q0  Y0
I2  W2  X2  Q2  Y2

In [58]:
df3.join(df4)

     W   X    Q    Y
I0  W0  X0   Q0   Y0
I1  W1  X1  NaN  NaN
I2  W2  X2   Q2   Y2